pengshulin/mcush/MindMotion/mm32f0/startup/startup_mm32.c
////////////////////////////////////////////////////////////////////////////////
/// @file    STARTUP_MM32.C
/// @author  AE TEAM
/// @version 2.0.0
/// @date    2018-08-01
/// @brief   THIS FILE PROVIDES ALL THE STARTUP FUNCTIONS.
////////////////////////////////////////////////////////////////////////////////
/// @attention
///
/// THE EXISTING FIRMWARE IS ONLY FOR REFERENCE, WHICH IS DESIGNED TO PROVIDE
/// CUSTOMERS WITH CODING INFORMATION ABOUT THEIR PRODUCTS SO THEY CAN SAVE
/// TIME. THEREFORE, MINDMOTION SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT OR
/// CONSEQUENTIAL DAMAGES ABOUT ANY CLAIMS ARISING OUT OF THE CONTENT OF SUCH
/// HARDWARE AND/OR THE USE OF THE CODING INFORMATION CONTAINED HEREIN IN
/// CONNECTION WITH PRODUCTS MADE BY CUSTOMERS.
///
/// <H2><CENTER>&COPY; COPYRIGHT 2018 MINDMOTION </CENTER></H2>
////////////////////////////////////////////////////////////////////////////////
#define _STARTUP_MM32_C_
////////////////////////////////////////////////////////////////////////////////

#include "types.h"
#include "startup_mm32.h"
#include "mm32.h"

extern void main(void);
extern char _sidata, _sdata, _edata, _sbss, _ebss, _sstack, _estack;

////////////////////////////////////////////////////////////////////////////////
/// @addtogroup MM32_Example_Layer
/// @{

////////////////////////////////////////////////////////////////////////////////
/// @addtogroup MM32_RESOURCE
/// @{

////////////////////////////////////////////////////////////////////////////////
/// @addtogroup MM32_Exported_Constants
/// @{

////////////////////////////////////////////////////////////////////////////////
//
//   KEIL development environment and definition
//
////////////////////////////////////////////////////////////////////////////////
#if defined(__KEIL)
/*----------------------------------------------------------------------------
  User Initial Stack & Heap
 *----------------------------------------------------------------------------*/
extern uint32_t Image$$ARM_LIB_STACK$$ZI$$Limit;

/*----------------------------------------------------------------------------
  Exception / Interrupt Handler Function Prototype
 *----------------------------------------------------------------------------*/
typedef void( *pFunc )( void );

extern void __main     (void) __attribute__((noreturn));                        ///< PreeMain (C library entry point)
#define __initial_sp    Image$$ARM_LIB_STACK$$ZI$$Limit
#endif


////////////////////////////////////////////////////////////////////////////////
#if defined(__MM3N1)
#if defined(__KEIL)
    const DeviceVectors __Vectors __attribute__((section ("RESET")));
    const DeviceVectors __Vectors = {
        .pvStack                        = (void*)(&__initial_sp),               ///< Keil Initial Stack Pointer
#else
    #pragma section     = ".intvec"
    #pragma location    = ".intvec"
    const DeviceVectors __vector_table = {
        (void*) __sfe("CSTACK"),                                                ///< IAR Initial Stack Pointer
#endif

    .pfnReset_Handler                   = (void*)Reset_Handler,                 ///< Reset Handler
    .pfnNMI_Handler                     = (void*)NMI_Handler,                   ///< NMI Handler
    .pfnHardFault_Handler               = (void*)HardFault_Handler,             ///< Hard Fault Handler
    .pfnMemManage_Handler               = (void*)MemManage_Handler,             ///< MPU Fault Handler
    .pfnBusFault_Handler                = (void*)BusFault_Handler,              ///< Bus Fault Handler
    .pfnUsageFault_Handler              = (void*)UsageFault_Handler,            ///< Usage Fault Handler
    .pfnReserved1_Handler               = (void*)(0UL),                         ///< Reserved
    .pfnReserved2_Handler               = (void*)(0UL),                         ///< Reserved
    .pfnReserved3_Handler               = (void*)(0UL),                         ///< Reserved
    .pfnReserved4_Handler               = (void*)(0UL),                         ///< Reserved
    .pfnSVC_Handler                     = (void*)SVC_Handler,                   ///< SVCall Handler
    .pfnDebugMon_Handler                = (void*)DebugMon_Handler,              ///< Debug Monitor Handler
    .pfnReserved5_Handler               = (void*)(0UL),                         ///< Reserved
    .pfnPendSV_Handler                  = (void*)PendSV_Handler,                ///< PendSV Handler
    .pfnSysTick_Handler                 = (void*)SysTick_Handler,               ///< SysTick Handler

    // Configurable interrupts
    .pfnWWDG_IRQHandler                 = (void*)WWDG_IRQHandler,               ///< Window Watchdog
    .pfnPVD_IRQHandler                  = (void*)PVD_IRQHandler,                ///< PVD through EXTI Line detect
    .pfnTAMPER_IRQHandler               = (void*)TAMPER_IRQHandler,             ///< Tamper
    .pfnRTC_IRQHandler                  = (void*)RTC_IRQHandler,                ///< RTC
    .pfnFLASH_IRQHandler                = (void*)FLASH_IRQHandler,              ///< Flash
    .pfnRCC_IRQHandler                  = (void*)RCC_IRQHandler,                ///< RCC
    .pfnEXTI0_IRQHandler                = (void*)EXTI0_IRQHandler,              ///< EXTI Line 0
    .pfnEXTI1_IRQHandler                = (void*)EXTI1_IRQHandler,              ///< EXTI Line 1
    .pfnEXTI2_IRQHandler                = (void*)EXTI2_IRQHandler,              ///< EXTI Line 2
    .pfnEXTI3_IRQHandler                = (void*)EXTI3_IRQHandler,              ///< EXTI Line 3
    .pfnEXTI4_IRQHandler                = (void*)EXTI4_IRQHandler,              ///< EXTI Line 4
    .pfnDMA1_Channel1_IRQHandler        = (void*)DMA1_Channel1_IRQHandler,      ///< DMA1 Channel 1
    .pfnDMA1_Channel2_IRQHandler        = (void*)DMA1_Channel2_IRQHandler,      ///< DMA1 Channel 2
    .pfnDMA1_Channel3_IRQHandler        = (void*)DMA1_Channel3_IRQHandler,      ///< DMA1 Channel 3
    .pfnDMA1_Channel4_IRQHandler        = (void*)DMA1_Channel4_IRQHandler,      ///< DMA1 Channel 4
    .pfnDMA1_Channel5_IRQHandler        = (void*)DMA1_Channel5_IRQHandler,      ///< DMA1 Channel 5
    .pfnDMA1_Channel6_IRQHandler        = (void*)DMA1_Channel6_IRQHandler,      ///< DMA1 Channel 6
    .pfnDMA1_Channel7_IRQHandler        = (void*)DMA1_Channel7_IRQHandler,      ///< DMA1 Channel 7
    .pfnADC1_2_IRQHandler               = (void*)ADC1_2_IRQHandler,             ///< ADC1 & ADC2
    .pfnUSB_HP_CAN1_TX_IRQHandler       = (void*)USB_HP_CAN1_TX_IRQHandler,     ///< USB High Priority or CAN1 TX
    .pfnReserved6_Handler               = (void*)(0UL),                         ///< Reserved
    .pfnCAN1_RX1_IRQHandler             = (void*)CAN1_RX1_IRQHandler,           ///< CAN1 RX1
    .pfnReserved7_Handler               = (void*)(0UL),                         ///< Reserved
    .pfnEXTI9_5_IRQHandler              = (void*)EXTI9_5_IRQHandler,            ///< EXTI Line 9..5
    .pfnTIM1_BRK_IRQHandler             = (void*)TIM1_BRK_IRQHandler,           ///< TIM1 Break
    .pfnTIM1_UP_IRQHandler              = (void*)TIM1_UP_IRQHandler,            ///< TIM1 Update
    .pfnTIM1_TRG_COM_IRQHandler         = (void*)TIM1_TRG_COM_IRQHandler,       ///< TIM1 Trigger and Commutation
    .pfnTIM1_CC_IRQHandler              = (void*)TIM1_CC_IRQHandler,            ///< TIM1 Capture Compare
    .pfnTIM2_IRQHandler                 = (void*)TIM2_IRQHandler,               ///< TIM2
    .pfnTIM3_IRQHandler                 = (void*)TIM3_IRQHandler,               ///< TIM3
    .pfnTIM4_IRQHandler                 = (void*)TIM4_IRQHandler,               ///< TIM4
    .pfnI2C1_EV_IRQHandler              = (void*)I2C1_EV_IRQHandler,            ///< I2C1 Event
    .pfnReserved8_Handler               = (void*)(0UL),                         ///< Reserved
    .pfnI2C2_EV_IRQHandler              = (void*)I2C2_EV_IRQHandler,            ///< I2C2 Event
    .pfnReserved9_Handler               = (void*)(0UL),                         ///< Reserved
    .pfnSPI1_IRQHandler                 = (void*)SPI1_IRQHandler,               ///< SPI1
    .pfnSPI2_IRQHandler                 = (void*)SPI2_IRQHandler,               ///< SPI2
    .pfnUART1_IRQHandler                = (void*)UART1_IRQHandler,              ///< UART1
    .pfnUART2_IRQHandler                = (void*)UART2_IRQHandler,              ///< UART2
    .pfnUART3_IRQHandler                = (void*)UART3_IRQHandler,              ///< UART3
    .pfnEXTI15_10_IRQHandler            = (void*)EXTI15_10_IRQHandler,          ///< EXTI Line 15..10
    .pfnRTCAlarm_IRQHandler             = (void*)RTCAlarm_IRQHandler,           ///< RTC Alarm through EXTI Line
    .pfnUSBWakeUp_IRQHandler            = (void*)USBWakeUp_IRQHandler,          ///< USB Wakeup from suspend
    .pfnReserved10_Handler              = (void*)(0UL),                         ///< Reserved
    .pfnReserved11_Handler              = (void*)(0UL),                         ///< Reserved
    .pfnAES_IRQHandler                  = (void*)AESEncrupt_IRQHandler          ///< USB Wakeup from suspend
};
#endif


////////////////////////////////////////////////////////////////////////////////
#if defined(__MM0N1)
//#if defined(__KEIL)
//    const DeviceVectors __Vectors __attribute__((section ("RESET")));
//    const DeviceVectors __Vectors = {
//        .pvStack                        = (void*)(&__initial_sp),               ///< Keil Initial Stack Pointer
//#else
//    #pragma section     = ".intvec"
//    #pragma location    = ".intvec"
//    const DeviceVectors __vector_table = {
//        (void*) __sfe("CSTACK"),                                                ///< IAR Initial Stack Pointer
//#endif
    extern char _estack;
    const DeviceVectors __vector_table __attribute__((section (".isr_vector")));
    const DeviceVectors __vector_table = {
    .pvStack                            = (void*)(&_estack),

