pengshulin/mcush/MindMotion/mm32f0/startup/startup_mm32.c
    .pfnReset_Handler                   = (void*)Reset_Handler,                 ///< Reset Handler
    .pfnNMI_Handler                     = (void*)NMI_Handler,                   ///< NMI Handler
    .pfnHardFault_Handler               = (void*)HardFault_Handler,             ///< Hard Fault Handler
    .pfnReserved1_Handler               = (void*)(0UL),                         ///< Reserved
    .pfnReserved2_Handler               = (void*)(0UL),                         ///< Reserved
    .pfnReserved3_Handler               = (void*)(0UL),                         ///< Reserved
    .pfnReserved4_Handler               = (void*)(0UL),                         ///< Reserved
    .pfnReserved5_Handler               = (void*)(0UL),                         ///< Reserved
    .pfnReserved6_Handler               = (void*)(0UL),                         ///< Reserved
    .pfnReserved7_Handler               = (void*)(0UL),                         ///< Reserved
    .pfnSVC_Handler                     = (void*)SVC_Handler,                   ///< SVCall Handler
    .pfnReserved8_Handler               = (void*)(0UL),                         ///< Reserved
    .pfnReserved9_Handler               = (void*)(0UL),                         ///< Reserved
    .pfnPendSV_Handler                  = (void*)PendSV_Handler,                ///< PendSV Handler
    .pfnSysTick_Handler                 = (void*)SysTick_Handler,               ///< SysTick Handler

    // Configurable interrupts
    .pfnWWDG_IRQHandler                 = (void*)WWDG_IRQHandler,               ///< Window Watchdog
    .pfnPVD_IRQHandler                  = (void*)PVD_IRQHandler,                ///< PVD through EXTI Line detect
    .pfnReserved10_Handler              = (void*)(0UL),                         ///< Reserved10_Handler
    .pfnFLASH_IRQHandler                = (void*)FLASH_IRQHandler,              ///< FLASH
    .pfnRCC_CRS_IRQHandler              = (void*)RCC_CRS_IRQHandler,            ///< RCC & CRS
    .pfnEXTI0_1_IRQHandler              = (void*)EXTI0_1_IRQHandler,            ///< EXTI Line 0 and 1
    .pfnEXTI2_3_IRQHandler              = (void*)EXTI2_3_IRQHandler,            ///< EXTI Line 2 and 3
    .pfnEXTI4_15_IRQHandler             = (void*)EXTI4_15_IRQHandler,           ///< EXTI Line 4 to 15
    .pfnReserved11_Handler              = (void*)(0UL),                         ///< Reserved
    .pfnDMA1_Channel1_IRQHandler        = (void*)DMA1_Channel1_IRQHandler,      ///< DMA1 Channel 1
    .pfnDMA1_Channel2_3_IRQHandler      = (void*)DMA1_Channel2_3_IRQHandler,    ///< DMA1 Channel 2 and Channel 3
    .pfnDMA1_Channel4_5_IRQHandler      = (void*)DMA1_Channel4_5_IRQHandler,    ///< DMA1 Channel 4 and Channel 5
    .pfnADC1_COMP_IRQHandler            = (void*)ADC1_COMP_IRQHandler,          ///< ADC1 & COMP
    .pfnTIM1_BRK_UP_TRG_COM_IRQHandler  = (void*)TIM1_BRK_UP_TRG_COM_IRQHandler,///< TIM1 Break, Update, Trigger and Commutation
    .pfnTIM1_CC_IRQHandler              = (void*)TIM1_CC_IRQHandler,            ///< TIM1 Capture Compare
    .pfnTIM2_IRQHandler                 = (void*)TIM2_IRQHandler,               ///< TIM2
    .pfnTIM3_IRQHandler                 = (void*)TIM3_IRQHandler,               ///< TIM3
    .pfnReserved12_Handler              = (void*)(0UL),                         ///< Reserved
    .pfnReserved13_Handler              = (void*)(0UL),                         ///< Reserved
    .pfnTIM14_IRQHandler                = (void*)TIM14_IRQHandler,              ///< TIM14
    .pfnReserved14_Handler              = (void*)(0UL),                         ///< Reserved
    .pfnTIM16_IRQHandler                = (void*)TIM16_IRQHandler,              ///< TIM16
    .pfnTIM17_IRQHandler                = (void*)TIM17_IRQHandler,              ///< TIM17
    .pfnI2C1_IRQHandler                 = (void*)I2C1_IRQHandler,               ///< I2C1
    .pfnReserved15_Handler              = (void*)(0UL),                         ///< Reserved
    .pfnSPI1_IRQHandler                 = (void*)SPI1_IRQHandler,               ///< SPI1
    .pfnSPI2_IRQHandler                 = (void*)SPI2_IRQHandler,               ///< SPI2
    .pfnUART1_IRQHandler                = (void*)UART1_IRQHandler,              ///< UART1
    .pfnUART2_IRQHandler                = (void*)UART2_IRQHandler,              ///< UART2
    .pfnAES_IRQHandler                  = (void*)AES_IRQHandler,                ///< AES
    .pfnCAN_IRQHandler                  = (void*)CAN_IRQHandler,                ///< CAN
    .pfnUSB_IRQHandler                  = (void*)USB_IRQHandler                 ///< USB
};
#endif

////////////////////////////////////////////////////////////////////////////////
#if defined(__MM0P1)
#if defined(__KEIL)
    const DeviceVectors __Vectors __attribute__((section ("RESET")));
    const DeviceVectors __Vectors = {
        .pvStack                        = (void*)(&__initial_sp),               ///< Keil Initial Stack Pointer
#else
    #pragma section     = ".intvec"
    #pragma location    = ".intvec"
    const DeviceVectors __vector_table = {
        (void*) __sfe("CSTACK"),                                                ///< IAR Initial Stack Pointer
#endif

    .pfnReset_Handler                   = (void*)Reset_Handler,                 ///< Reset Handler
    .pfnNMI_Handler                     = (void*)NMI_Handler,                   ///< NMI Handler
    .pfnHardFault_Handler               = (void*)HardFault_Handler,             ///< Hard Fault Handler
    .pfnMemManage_Handler               = (void*)MemManage_Handler,             ///< MPU Fault Handler
    .pfnBusFault_Handler                = (void*)BusFault_Handler,              ///< Bus Fault Handler
    .pfnUsageFault_Handler              = (void*)UsageFault_Handler,            ///< Usage Fault Handler
    .pfnReserved1_Handler               = (void*)0,                             ///< Reserved
    .pfnReserved2_Handler               = (void*)0,                             ///< Reserved
    .pfnReserved3_Handler               = (void*)0,                             ///< Reserved
    .pfnReserved4_Handler               = (void*)0,                             ///< Reserved
    .pfnSVC_Handler                     = (void*)SVC_Handler,                   ///< SVCall Handler
    .pfnDebugMon_Handler                = (void*)DebugMon_Handler,              ///< Debug Monitor Handler
    .pfnReserved5_Handler               = (void*)0,                             ///< Reserved
    .pfnPendSV_Handler                  = (void*)PendSV_Handler,                ///< PendSV Handler
    .pfnSysTick_Handler                 = (void*)SysTick_Handler,               ///< SysTick Handler

    // External Interrupts
    .pfnWWDG_IWDG_IRQHandler            = (void*)WWDG_IWDG_IRQHandler,          ///< Window Watchdog and Independent Watchdog
    .pfnPVD_IRQHandler                  = (void*)PVD_IRQHandler,                ///< PVD through EXTI Line detect
    .pfnPWM_IRQHandler                  = (void*)PWM_IRQHandler,                ///< PWM Control interrupt
    .pfnFLASH_IRQHandler                = (void*)FLASH_IRQHandler,              ///< FLASH
    .pfnRCC_IRQHandler                  = (void*)RCC_IRQHandler,                ///< RCC  interrupt
    .pfnEXTI0_1_IRQHandler              = (void*)EXTI0_1_IRQHandler,            ///< EXTI Line 0 and 1
    .pfnEXTI2_3_IRQHandler              = (void*)EXTI2_3_IRQHandler,            ///< EXTI Line 2 and 3
    .pfnEXTI4_15_IRQHandler             = (void*)EXTI4_15_IRQHandler,           ///< EXTI Line 4 to 15
    .pfnHWDIV_IRQHandler                = (void*)HWDIV_IRQHandler,              ///< HWDIV
    .pfnDMA1_Channel1_IRQHandler        = (void*)DMA1_Channel1_IRQHandler,      ///< DMA1 Channel 1
    .pfnDMA1_Channel2_3_IRQHandler      = (void*)DMA1_Channel2_3_IRQHandler,    ///< DMA1 Channel 2 and Channel 3
    .pfnDMA1_Channel4_5_IRQHandler      = (void*)DMA1_Channel4_5_IRQHandler,    ///< DMA1 Channel 4 and Channel 5
    .pfnADC1_IRQHandler                 = (void*)ADC1_IRQHandler,               ///< ADC1 interrupt
    .pfnTIM1_BRK_UP_TRG_COM_IRQHandler  = (void*)TIM1_BRK_UP_TRG_COM_IRQHandler,///< TIM1 Break, Update, Trigger and Commutation
    .pfnTIM1_CC_IRQHandler              = (void*)TIM1_CC_IRQHandler,            ///< TIM1 Capture Compare
    .pfnTIM2_IRQHandler                 = (void*)TIM2_IRQHandler,               ///< TIM2
    .pfnTIM3_IRQHandler                 = (void*)TIM3_IRQHandler,               ///< TIM3
    .pfnTIM8_BRK_UP_TRG_COM_IRQHandler  = (void*)TIM8_BRK_UP_TRG_COM_IRQHandler,///< TIM8 Break, Update, Trigger and Commutation
    .pfnTIM8_CC_IRQHandler              = (void*)TIM8_CC_IRQHandler,            ///< TIM8 Capture Compare
    .pfnTIM14_IRQHandler                = (void*)TIM14_IRQHandler,              ///< TIM14
    .pfnADC2_IRQHandler                 = (void*)ADC2_IRQHandler,               ///< ADC2
    .pfnTIM16_IRQHandler                = (void*)TIM16_IRQHandler,              ///< TIM16
    .pfnTIM17_IRQHandler                = (void*)TIM17_IRQHandler,              ///< TIM17
    .pfnI2C1_IRQHandler                 = (void*)I2C1_IRQHandler,               ///< I2C1
    .pfnCOMP_1_2_3_4_5_IRQHandler       = (void*)COMP_1_2_3_4_5_IRQHandler,     ///< COMP
    .pfnSPI1_IRQHandler                 = (void*)SPI1_IRQHandler,               ///< SPI1
    .pfnSPI2_IRQHandler                 = (void*)SPI2_IRQHandler,               ///< SPI2
    .pfnUART1_IRQHandler                = (void*)UART1_IRQHandler,              ///< UART1
    .pfnUART2_IRQHandler                = (void*)UART2_IRQHandler,              ///< UART2
    .pfnCache_IRQHandler                = (void*)Cache_IRQHandler               ///< Cache
};
#endif


////////////////////////////////////////////////////////////////////////////////
#if defined(__MM0Q1)
#if defined(__KEIL)
    const DeviceVectors __Vectors __attribute__((section ("RESET")));
    const DeviceVectors __Vectors = {
        .pvStack                        = (void*)(&__initial_sp),               ///< Keil Initial Stack Pointer
#else
    #pragma section     = ".intvec"
    #pragma location    = ".intvec"
    const DeviceVectors __vector_table = {
        (void*) __sfe("CSTACK"),                                                ///< IAR Initial Stack Pointer
#endif

