pengshulin/mcush/MindMotion/mm32f0/startup/startup_mm32.c
    .pfnReset_Handler                   = (void*)Reset_Handler,                 ///< Reset Handler
    .pfnNMI_Handler                     = (void*)NMI_Handler,                   ///< NMI Handler
    .pfnHardFault_Handler               = (void*)HardFault_Handler,             ///< Hard Fault Handler
    .pfnMemManage_Handler               = (void*)MemManage_Handler,             ///< MPU Fault Handler
    .pfnBusFault_Handler                = (void*)BusFault_Handler,              ///< Bus Fault Handler
    .pfnUsageFault_Handler              = (void*)UsageFault_Handler,            ///< Usage Fault Handler
    .pfnReserved1_Handler               = (void*)(0UL),                         ///< Reserved
    .pfnReserved2_Handler               = (void*)(0UL),                         ///< Reserved
    .pfnReserved3_Handler               = (void*)(0UL),                         ///< Reserved
    .pfnReserved4_Handler               = (void*)(0UL),                         ///< Reserved
    .pfnSVC_Handler                     = (void*)SVC_Handler,                   ///< SVCall Handler
    .pfnDebugMon_Handler                = (void*)DebugMon_Handler,              ///< Debug Monitor Handler
    .pfnReserved5_Handler               = (void*)(0UL),                         ///< Reserved
    .pfnPendSV_Handler                  = (void*)PendSV_Handler,                ///< PendSV Handler
    .pfnSysTick_Handler                 = (void*)SysTick_Handler,               ///< SysTick Handler

    // Configurable interrupts
    .pfnWWDG_IWDG_IRQHandler            = (void*)WWDG_IWDG_IRQHandler,          ///< Window Watchdog and Independent Watchdog         // Window Watchdog
    .pfnPVD_IRQHandler                  = (void*)PVD_IRQHandler,                ///< PVD through EXTI Line detect                   // PVD through EXTI Line detect
    .pfnPWM_IRQHandler                  = (void*)PWM_IRQHandler,                ///< PWM Control interrupt                          // PWM
    .pfnFLASH_IRQHandler                = (void*)FLASH_IRQHandler,              ///< FLASH                                          // FLASH
    .pfnRCC_IRQHandler                  = (void*)RCC_IRQHandler,                ///< RCC                                                // RCC & CRS
    .pfnEXTI0_1_IRQHandler              = (void*)EXTI0_1_IRQHandler,            ///< EXTI Line 0 and 1                              // EXTI Line 0 and 1
    .pfnEXTI2_3_IRQHandler              = (void*)EXTI2_3_IRQHandler,            ///< EXTI Line 2 and 3                              // EXTI Line 2 and 3
    .pfnEXTI4_15_IRQHandler             = (void*)EXTI4_15_IRQHandler,           ///< EXTI Line 4 to 15                              // EXTI Line 4 to 15
    .pfnHWDIV_IRQHandler                = (void*)HWDIV_IRQHandler,              ///< HWDIV                                          // Reserved
    .pfnDMA1_Channel1_IRQHandler         = (void*)DMA1_Channel1_IRQHandler,       ///< DMA1 Channel 1                                   // DMA1 Channel 1
    .pfnDMA1_Channel2_3_IRQHandler       = (void*)DMA1_Channel2_3_IRQHandler,     ///< DMA1 Channel 2 and Channel 3                     // DMA1 Channel 2 and Channel 3
    .pfnDMA1_Channel4_5_IRQHandler       = (void*)DMA1_Channel4_5_IRQHandler,     ///< DMA1 Channel 4 and Channel 5                     // DMA1 Channel 4 and Channel 5
    .pfnADC_COMP_IRQHandler             = (void*)ADC_COMP_IRQHandler,           ///< ADC1 and Compare   interrupt
    .pfnTIM1_BRK_UP_TRG_COM_IRQHandler  = (void*)TIM1_BRK_UP_TRG_COM_IRQHandler,///< TIM1 Break, Update, Trigger and Commutation      // TIM1 Break, Update, Trigger and Commutation
    .pfnTIM1_CC_IRQHandler              = (void*)TIM1_CC_IRQHandler,            ///< TIM1 Capture Compare                           // TIM1 Capture Compare
    .pfnTIM2_IRQHandler                 = (void*)TIM2_IRQHandler,               ///< TIM2                                           // TIM2
    .pfnTIM3_IRQHandler                 = (void*)TIM3_IRQHandler,               ///< TIM3                                           // TIM3
    .pfnReserved6_Handler               = (void*)(0UL),                         ///< Reserved
    .pfnReserved7_Handler               = (void*)(0UL),                         ///< Reserved
    .pfnTIM14_IRQHandler                = (void*)TIM14_IRQHandler,              ///< TIM14
    .pfnReserved8_Handler               = (void*)(0UL),                         ///< Reserved
    .pfnTIM16_IRQHandler                = (void*)TIM16_IRQHandler,              ///< TIM16
    .pfnTIM17_IRQHandler                = (void*)TIM17_IRQHandler,              ///< TIM17
    .pfnI2C1_IRQHandler                 = (void*)I2C1_IRQHandler,               ///< I2C1
    .pfnReserved9_Handler               = (void*)(0UL),                         ///< Reserved
    .pfnSPI1_IRQHandler                 = (void*)SPI1_IRQHandler,               ///< SPI1 IRQHandler
    .pfnSPI2_IRQHandler                 = (void*)SPI2_IRQHandler,               ///< SPI2
    .pfnUART1_IRQHandler                = (void*)UART1_IRQHandler,              ///< UART1
    .pfnUART2_IRQHandler                = (void*)UART2_IRQHandler               ///< UART2
};
#endif
/// @}

////////////////////////////////////////////////////////////////////////////////
/// @addtogroup MM32_Exported_Functions
/// @{

////////////////////////////////////////////////////////////////////////////////
/// @brief  This is the code that gets called on processor reset. To initialize the
/// @        device.
/// @param  None.
/// @retval None.
////////////////////////////////////////////////////////////////////////////////
void Reset_Handler(void)
{
//#if defined(__KEIL)
//  __main();                                 /* Enter PreeMain (C library entry point) */
//#else
//    __iar_program_start();
//#endif

    /* basic environment pre-init before main */
    /* patched by PengShulin <trees_peng@163.com> 2020 */
    register uint32_t i, *p, *p2;
    
    /* data area init from flash */
    i = ((uint32_t)&_edata - (uint32_t)&_sdata) / 4;
    p = (uint32_t*)&_sidata;
    p2 = (uint32_t*)&_sdata;
    while( i-- )
        *p2++ = *p++;
 
    /* bss area init as zero */
    i = ((uint32_t)&_ebss - (uint32_t)&_sbss) / 4;
    p = (uint32_t*)&_sbss;
    while( i-- )
        *p++ = 0;
  
    /* fill stack with fixed pattern for watermark check */ 
    //i = ((uint32_t)&_estack - (uint32_t)&_sstack) / 4;
    //p = (uint32_t*)&_sstack;
    //while( i-- )
    //    *p++ = 0xA5A5A5A5;

    /* main app */ 
    main();
   
    /* should not run to here */ 
    while(1) {}
}


////////////////////////////////////////////////////////////////////////////////
/// @brief  This is the code that gets called on processor reset. To initialize
///         the device.
/// @param  None.
/// @retval  If return 0, the data sections will not be initialized.
////////////////////////////////////////////////////////////////////////////////
int __low_level_init(void)
{
#if defined(__KEIL)
    return 0;
#else
#if defined(__MM3N1)
    u32 *pSrc = __section_begin(".intvec");
    SCB->VTOR = ((u32) pSrc & SCB_VTOR_TBLOFF_Msk);
#endif
    return 1;       // if return 0, the data sections will not be initialized
#endif
}

////////////////////////////////////////////////////////////////////////////////
/// @brief  Default interrupt handler for unused IRQs.
/// @param  None.
/// @retval None.
////////////////////////////////////////////////////////////////////////////////
void Dummy_Handler(void)
{
    while(1) {}
}


/// @}

/// @}

/// @}
